<<<<<<< HEAD
//_à Íàïèñàòü ïåðåãðóæåííûå øàáëîíû ôóíêöèé äëÿ íàõîæäåíèÿ êîðíåé ëèíåéíîãî (a*x + b = 0)
//è êâàäðàòíîãî (a*x2+b*x + c = 0) óðàâíåíèé. Çàìå÷àíèå: â ôóíêöèè ïåðåäàþòñÿ êîýôôèöèåíòû
//óðàâíåíèé. 
=======
//_Ð° ÐÐ°Ð¿Ð¸ÑÐ°Ñ‚ÑŒ Ð¿ÐµÑ€ÐµÐ³Ñ€ÑƒÐ¶ÐµÐ½Ð½Ñ‹Ðµ ÑˆÐ°Ð±Ð»Ð¾Ð½Ñ‹ Ñ„ÑƒÐ½ÐºÑ†Ð¸Ð¹ Ð´Ð»Ñ Ð½Ð°Ñ…Ð¾Ð¶Ð´ÐµÐ½Ð¸Ñ ÐºÐ¾Ñ€Ð½ÐµÐ¹ Ð»Ð¸Ð½ÐµÐ¹Ð½Ð¾Ð³Ð¾ (a*x + b = 0)
//Ð¸ ÐºÐ²Ð°Ð´Ñ€Ð°Ñ‚Ð½Ð¾Ð³Ð¾ (a*x2+b*x + c = 0) ÑƒÑ€Ð°Ð²Ð½ÐµÐ½Ð¸Ð¹. Ð—Ð°Ð¼ÐµÑ‡Ð°Ð½Ð¸Ðµ: Ð² Ñ„ÑƒÐ½ÐºÑ†Ð¸Ð¸ Ð¿ÐµÑ€ÐµÐ´Ð°ÑŽÑ‚ÑÑ ÐºÐ¾ÑÑ„Ñ„Ð¸Ñ†Ð¸ÐµÐ½Ñ‚Ñ‹
//ÑƒÑ€Ð°Ð²Ð½ÐµÐ½Ð¸Ð¹. 
>>>>>>> c0ad407ecd83aa6bee2290b638c63333c0e9ee07

package lesson9;

public class Equation {
	
<<<<<<< HEAD
	//_à Ìåòîä äëÿ ëèíåéíîãî óðàâíåíèÿ
	//_à 	a*x + b = 0
=======
	//_Ð° ÐœÐµÑ‚Ð¾Ð´ Ð´Ð»Ñ Ð»Ð¸Ð½ÐµÐ¹Ð½Ð¾Ð³Ð¾ ÑƒÑ€Ð°Ð²Ð½ÐµÐ½Ð¸Ñ
	//_Ð° 	a*x + b = 0
>>>>>>> c0ad407ecd83aa6bee2290b638c63333c0e9ee07
	public static  void linear (double a, double b) {
		System.out.println( -b/a ); 
	}
	
<<<<<<< HEAD
	//_à Ìåòîä äëÿ êâàäðàòíîãî óðàâíåíèÿ
	//_à 	a*x2 + b*x + c = 0
=======
	//_Ð° ÐœÐµÑ‚Ð¾Ð´ Ð´Ð»Ñ ÐºÐ²Ð°Ð´Ñ€Ð°Ñ‚Ð½Ð¾Ð³Ð¾ ÑƒÑ€Ð°Ð²Ð½ÐµÐ½Ð¸Ñ
	//_Ð° 	a*x2 + b*x + c = 0
>>>>>>> c0ad407ecd83aa6bee2290b638c63333c0e9ee07
		public static  void quadratic (double a, double b, double c) {
			
			System.out.println( (-b-Math.sqrt(b*b - 4*a*c))/(2*a) );
			System.out.println( (-b+Math.sqrt(b*b - 4*a*c))/(2*a) ); 
		}
	

	public static void main(String[] args) {
		
<<<<<<< HEAD
		//_à Âûçîâ ìåòîäà äëÿ ëèíåéíîãî óðàâíåíèÿ
		linear(-0.12, -0.3);
		
		//_à Âûçîâ ìåòîäà äëÿ êâàäðàòíîãî óðàâíåíèÿ
=======
		//_Ð° Ð’Ñ‹Ð·Ð¾Ð² Ð¼ÐµÑ‚Ð¾Ð´Ð° Ð´Ð»Ñ Ð»Ð¸Ð½ÐµÐ¹Ð½Ð¾Ð³Ð¾ ÑƒÑ€Ð°Ð²Ð½ÐµÐ½Ð¸Ñ
		linear(-0.12, -0.3);
		
		//_Ð° Ð’Ñ‹Ð·Ð¾Ð² Ð¼ÐµÑ‚Ð¾Ð´Ð° Ð´Ð»Ñ ÐºÐ²Ð°Ð´Ñ€Ð°Ñ‚Ð½Ð¾Ð³Ð¾ ÑƒÑ€Ð°Ð²Ð½ÐµÐ½Ð¸Ñ
>>>>>>> c0ad407ecd83aa6bee2290b638c63333c0e9ee07
		quadratic(2, 1, 0);

	}

}
